queens_aaa_workflow/openfoam_cases/case_004/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-37.837783 -25.500523 -56.216996)
    (75.750848 -25.500523 -56.216996)
    (75.750848 154.197435 -56.216996)
    (-37.837783 154.197435 -56.216996)
    (-37.837783 -25.500523 56.216996)
    (75.750848 -25.500523 56.216996)
    (75.750848 154.197435 56.216996)
    (-37.837783 154.197435 56.216996)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (228 360 225) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
