queens_aaa_workflow/openfoam_cases/case_004/system/snappyHexMeshDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    inlet
    {
        type triSurfaceMesh;
        file "inlet.stl";
    }
    
    outlet
    {
        type triSurfaceMesh;
        file "outlet.stl";
    }

    wall
    {
        type triSurfaceMesh;
        file "wall.stl";
    }
}

castellatedMeshControls
{
    maxLocalCells   10000000;
    maxGlobalCells  10000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 2;
    locationInMesh (17.12 64.35 -0.00)    ;
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 30;
    features
    (
        {
            file "inlet.eMesh";
            level 0;
        }
        {
            file "outlet.eMesh";
            level 0;
        }
        {
            file "wall.eMesh";
            level 0;
        }

    );
    refinementSurfaces
    {
        inlet
        {
            level (0 1);
            patchInfo { type patch; }
        }
        outlet
        {
            level (0 1);
            patchInfo { type patch; }
        }
        wall
        {
            level (1 2);
            patchInfo { type wall; }
        }

    }
    refinementRegions
    {

    }
}

snapControls
{
    nSmoothPatch    5;
    tolerance       1.0;
    nSolveIter      300;
    nRelaxIter      10;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes   true;
    expansionRatio  1.1;
    finalLayerThickness 0.3;
    minThickness    0.01;
    nGrow           0;
    featureAngle    180;
    slipFeatureAngle 70;
    nRelaxIter      3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals  3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter      50;
    layers
    {
        inlet
        {
             nSurfaceLayers 0;
        }
        outlet
        {
             nSurfaceLayers 0;
        }
        wall
        {
             nSurfaceLayers 5;
        }

    }
}

meshQualityControls
{
    maxNonOrtho     70;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-15;
    minTetQuality   1e-15;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.05;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
}

writeFlags      ( scalarLevels layerSets layerFields );

mergeTolerance  1e-06;